/**
 * Date : 2024-10-19
 * By   : yinlianhua@ucloud.cn
 **/

'use strict';

const _      = require("underscore");
const moment = require("moment");

// 打印QH数据
const data_log = async function(std_time, info_list, qh_pos) {
    // +-------------------------------------------------------------------------------------------+---------------------|
    // |                               2024-10-24 11:37:59 [ 300 秒后收盘 ]                        |     盈亏(+300)      |
    // +-------------------------------------------------------------------------------------------+---------------------|
    // | 白银 - 开盘价: 8290 最新价: 8163 [ 71:130] [ 8092 ~ 8293 ] 偏空 ★★☆☆☆ 波动: 201 回撤: 35% |                     |
    // | 螺纹 - 开盘价: 3307 最新价: 3315 [ 20: 12] [ 3295 ~ 3327 ] 偏多 ★★★☆☆ 波动:  32 回撤: 37% |                     |
    // | 玻璃 - 开盘价: 1260 最新价: 1292 [ 35: 18] [ 1257 ~ 1310 ] 偏多 ★★★☆☆ 波动:  53 回撤: 33% |                     |
    // | 纯碱 - 开盘价: 1508 最新价: 1524 [ 23: 18] [ 1501 ~ 1542 ] 偏多 ★★★☆☆ 波动:  41 回撤: 43% | 多 1 手  1525   -40 |
    // | 烧碱 - 开盘价: 2618 最新价: 2642 [ 61:  6] [ 2581 ~ 2648 ] 强多 ★★★★★ 波动:  67 回撤:  8% |                     |
    // | 乙烯 - 开盘价: 5382 最新价: 5401 [ 31: 24] [ 5370 ~ 5425 ] 偏多 ★★★☆☆ 波动:  55 回撤: 43% |                     |
    // | 玉米 - 开盘价: 2228 最新价: 2234 [ 15:  7] [ 2219 ~ 2241 ] 偏多 ★★★☆☆ 波动:  22 回撤: 31% | 多 1 手  2200  +340 |
    // | 白糖 - 开盘价: 5887 最新价: 5944 [ 62: 14] [ 5882 ~ 5958 ] 强多 ★★★★☆ 波动:  76 回撤: 18% |                     |
    // | 棉花 - 开盘价:14095 最新价:14205 [130: 40] [14075 ~14245 ] 偏多 ★★★☆☆ 波动: 170 回撤: 23% | 多 1 手 14205     0 |
    // | 燃油 - 开盘价: 3107 最新价: 3118 [ 25: 10] [ 3093 ~ 3128 ] 偏多 ★★★☆☆ 波动:  35 回撤: 28% |                     |
    // | 甲醇 - 开盘价: 2418 最新价: 2444 [ 31:  2] [ 2413 ~ 2446 ] 强多 ★★★★★ 波动:  33 回撤:  6% |                     |
    // | 锰硅 - 开盘价: 6124 最新价: 6112 [ 26: 16] [ 6086 ~ 6128 ] 偏多 ★★★☆☆ 波动:  42 回撤: 38% |                     |
    // +-------------------------------------------------------------------------------------------+---------------------|

    let logs = [];

    let pos_map = _.indexBy(qh_pos, "持仓名称");

    let time = moment().format("YYYY-MM-DD HH:mm:ss");
    logs.push("+-----------------------------------------------------------------------+----------------------|");
    logs.push(`|                        ${time}                            |     盈亏(${String(pos_map["合计"]["持仓盈亏"]).padStart(5)})      |`);
    // logs.push("+-----------------------------------------------------------------------+----------------------|");

    let data_list1 = _.filter(info_list, (elem) => { return elem["多空态"] == "强多"; });
    let data_list2 = _.filter(info_list, (elem) => { return elem["多空态"] == "偏多"; });
    let data_list3 = _.filter(info_list, (elem) => { return elem["多空态"] == "偏空"; });
    let data_list4 = _.filter(info_list, (elem) => { return elem["多空态"] == "强空"; });

    for (let data_list of [ data_list1, data_list2, data_list3, data_list4 ]) {
        if (data_list.length == 0) {
            continue;
        }

        logs.push(`+----------------------------------${data_list[0]["多空态"]}---------------------------------+----------------------|`);

        for (let info of data_list) {
            info["低位差"] = String(info["最新价"]-info["最低价"]).padStart(3);
            info["高位差"] = String(info["最高价"]-info["最新价"]).padStart(3);
            info["开盘价"] = String(info["开盘价"]).padStart(5);
            info["最高价"] = String(info["最高价"]).padStart(5);
            info["最低价"] = String(info["最低价"]).padStart(5);
            info["最新价"] = String(info["最新价"]).padStart(5);
            info["结算价"] = String(info["结算价"]).padStart(5);
            info["昨结算"] = String(info["昨结算"]).padStart(5);
            info["波动量"] = String(info["波动量"]).padStart(4);
            info["回撤比"] = String(info["回撤比"]).padStart(3);

            let qh_log = `| ${info["子名称"]} - ${info["最新价"]} [${info["低位差"]}:${info["高位差"]}] [${info["最低价"]} ~${info["最高价"]} ] ${info["多空态"]} ${info["强度比"]} 波动:${info["波动量"]} 回撤:${info["回撤比"]}% |`;

            if (pos_map[info["子名称"]] != undefined) {
                let pos_info = pos_map[info["子名称"]];
                // 添加持仓信息
                qh_log += ` ${pos_info["持仓类型"]}${String(pos_info["持仓数量"]).padStart(2)} 手 ${String(pos_info["持仓点位"]).padStart(6)} ${String(pos_info["持仓盈亏"]).padStart(5)} |`;
            } else {
                qh_log += "                      |";
            }

            logs.push(qh_log);
        }
    }

    logs.push("+-----------------------------------------------------------------------+----------------------|");

    for (let log of logs) {
        global.logger.info(log);
    }
}



module.exports = data_log;
